Yen-Lung-Huang/ARM-Microcontroller/STM32/STM32L053/NUCLEO-L053R8_Projects/HC-SR04/01_HC-SR04/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usart.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern UART_HandleTypeDef huart2;
extern DMA_HandleTypeDef hdma_usart2_rx;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
#define RxBuf_SIZE 256
#define MainBuf_SIZE RxBuf_SIZE
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
extern uint8_t RxBuf[RxBuf_SIZE]; 		// DMA receive buffer.
extern uint8_t MainBuf[MainBuf_SIZE];	// RX receive. 
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI4_15_IRQn
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define HC_SR04_Middle_Echo_Pin GPIO_PIN_10
#define HC_SR04_Middle_Echo_GPIO_Port GPIOC
#define HC_SR04_Middle_Echo_EXTI_IRQn EXTI4_15_IRQn
#define HC_SR04_Left_Echo_Pin GPIO_PIN_11
#define HC_SR04_Left_Echo_GPIO_Port GPIOC
#define HC_SR04_Left_Echo_EXTI_IRQn EXTI4_15_IRQn
#define HC_SR04_Right_Echo_Pin GPIO_PIN_12
#define HC_SR04_Right_Echo_GPIO_Port GPIOC
#define HC_SR04_Right_Echo_EXTI_IRQn EXTI4_15_IRQn
#define HC_SR04_All_Trig_Pin GPIO_PIN_2
#define HC_SR04_All_Trig_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
